<template>
  <div class="Photogs">
    <comp-card :arrImgText="arrImgText" :openClick="openClick">
      <!--  -->
    </comp-card>
    <!-- 弹框 -->
    <el-dialog
      :title="dialogTitle"
      :visible.sync="open"
      width="40%"
      class="dialogLand">
      <div class="dialog-text">
        <div class="">
          <!-- 弹窗内容 -->

          <el-image :src="textImg"
            ><div slot="placeholder" class="image-slot">
              加载中<span class="dot">...</span>
            </div></el-image
          >
        </div>
        <div class="">
          <!-- 弹窗内容 -->
          {{ textVlaue }}
        </div>
      </div>
    </el-dialog>
  </div>
</template>

<script>
import CompCard from "../components/CompCard.vue"

export default {
  // 注册
  components: {
    CompCard,
  },

  data() {
    return {
      // 图片
      textImg: "",
      // 内容
      textVlaue: "",
      // 遮罩层
      loading: true,
      // 弹出层标题
      dialogTitle: "",
      // 是否显示弹出层
      open: false,
      // 卡片数据
      arrImgText: [
        {
          id: 1,
          title: "广东粤剧博物馆",
          imgUrl: require("@/./assets/imgage/IMG_20220610_185733.jpg"),
          text: " 2012年，为保护和传承广东省唯一的世界非物质文化遗产——粤剧艺术，广州市政府决定于荔湾老城区建设粤剧艺术博物馆[2]。同年3月，广州市政府牵头成立了粤剧艺术博物馆筹建领导小组，下设办公室在荔湾区政府，正式启动粤剧艺术博物馆项目筹建工作。同年11月26日上午，广州市在恩宁路举行粤剧艺术博物馆奠基仪式。2012年，为保护和传承广东省唯一的世界非物质文化遗产——粤剧艺术，广州市政府决定于荔湾老城区建设粤剧艺术博物馆[2]。同年3月，广州市政府牵头成立了粤剧艺术博物馆筹建领导小组，下设办公室在荔湾区政府，正式启动粤剧艺术博物馆项目筹建工作。同年11月26日上午，广州市在恩宁路举行粤剧艺术博物馆奠基仪式。",
        },
        {
          id: 2,
          title: "菌类",
          imgUrl: require("@/./assets/imgage/IMG_20220611_181906.jpg"),
          text: " 这是2022年在东莞松山湖森林公园里拍的，当时的这几天是下着小雨的，沿着松山湖边沿走了差不多一圈可以发现很多有趣的小物品，当时还是荔枝的旺季。我们走到荔枝树下偷偷的摘下几颗来吃，要是被人发现估计的抓起来赔钱，哈哈哈哈哈！拍了很多照片，这是唯一一张满意的出片度很高。",
        },
        {
          id: 3,
          title: "早晨的日出",
          imgUrl: require("@/./assets/imgage/the_sky.jpg"),
          text: "这是2022年10月02日，在老爸工作的船尾上拍的，那时候在老爸工作的船上过了一夜，早早就起床看日出随手就拍下了这张图片，这张图片显得多安静，拍的时候海里的渔民早早的开着小船出来捕鱼工作了，站在船尾上闭上眼睛静静的感受海风吹到脸上是多舒服。",
        },
        {
          id: 4,
          title: "广州海心沙晚霞",
          imgUrl: require("@/./assets/imgage/gz_hcs.jpg"),
          text: "这是在广州海心沙刚建不久的人行桥上拍的，当时站在桥上拍下的这一幕晚霞，这日落虽然没有想象的这么美，但是也算是很温馨的色调，所以记录一下当下的一幕，不过这拍照的技术有待提升，想维持好现在唯一的爱好，走过每一个地方就记录每一个地方最美的一瞬间，这岂不美哉？因为一生中被我们忽略掉美好的东西实在再多了。",
        },
        {
          id: 5,
          title: "广州文化馆",
          imgUrl: require("@/./assets/imgage/gzwhg.jpg"),
          text: "广州市文化馆（原广州市群众艺术馆）成立于1956年，是国家设立的公益性文化事业单位，隶属于广州市文化广电旅游局。新馆项目选址于广州新中轴南段、海珠湖东北侧地块，北邻新滘中路、东靠新光快速路、西南与海珠湖相望。",
        },
        {
          id: 6,
          title: "深圳人才公园",
          imgUrl: require("@/./assets/imgage/sz.jpg"),
          text: "人才公园地处深圳市南山区后海片区，毗邻深圳湾超级总部基地，与深圳湾滨海休闲带相连，占地面积77万平方米，其中湖体面积30万平方米。",
        },
        {
          id: 7,
          title: "滇池大坝的海鸥",
          imgUrl: require("@/./assets/imgage/IMG_20240225_112018.jpg"),
          text: "海埂大坝的海鸥真的特别多 大坝是全天都免费开放的 步道全长三公里左右走完还是很累的 想喂海鸥可以先去附近超市买点面包不贵也就十块钱一大袋 步道上买的海鸥饲料我感觉海鸥不太喜欢吃 我喂它们吃都不吃饲料就吃面包。",
        },
        {
          id: 8,
          title: "民族村",
          imgUrl: require("@/./assets/imgage/IMG_20240225_140805.jpg"),
          text: "云南民族村自1992年2月建成开放以来，以生动鲜活的形态，展示了云南各民族的建筑艺术、歌舞服饰、文化风情、宗教信仰和生活习俗。展示的国家级民俗类非物质文化遗产节庆活动如火把节、泼水节、目瑙纵歌节等10余项；木鼓舞、锅庄舞、傈僳族民歌、彝族海菜腔等国家级、省级、民间音乐及歌舞类非物质文化遗产30余项；户撒刀制作技艺、剑川木雕技艺、彝族刺绣技艺等国家级、省级、市级传统手工技艺类非物质文化遗产10余项。",
        },
        {
          id: 9,
          title: "宜良九乡",
          imgUrl: require("@/./assets/imgage/IMG_20240302_141356.jpg"),
          text: "宜良九乡风景区地处山区、气候温凉，区内峰峦连绵，山峰谷底相对高差200米左右，地表海拔在1750~1900米之间，地势起伏不大。显示出溶洞分布区内地势上升，河流下切浸蚀的青幼年期河流地貌景观。九乡境内森林茂密，覆盖率达62.3%，珍贵动、植物资源丰富。张口洞古人类居住遗址，代表了我国南方一种独特的旧石器文化，被称为“九乡一绝”。",
        },
        {
          id: 10,
          title: "石林",
          imgUrl: require("@/./assets/imgage/IMG_20240302_181758.jpg"),
          text: "昆明市石林风景区开发为游览区的主要是：石林风景区、黑松岩（乃古石林）风景区、飞龙瀑（大叠水）风景区、长湖风景区。昆明市石林风景区已被联合国文教科评为“世界地质公园”，“世界自然遗产风光”。1982年，经国务院批准成为首批国家级重点风景名胜区之一，是国家5A级旅游景区、全国文明风景旅游区。",
        },
        {
          id: 11,
          title: "大理（洱海）",
          imgUrl: require("@/./assets/imgage/IMG_20240316_171758.jpg"),
          text: "洱海，古称昆明池、洱河、叶榆泽等。位于云南省大理白族自治州大理市。一般湖水面积约246平方千米（一说252平方公里 [41]），蓄水量约29.5亿立方米，呈狭长形，北起洱源县南端，南止大理市下关，南北长40公里，是仅次于滇池的云南第二大湖。洱海形成于冰河时代末期，其成因主要是沉降侵蚀，属高原构造断陷湖泊，海拔1972米。",
        },
        {
          id: 12,
          title: "大理（古城）",
          imgUrl: require("@/./assets/imgage/IMG_20240316_204738.jpg"),
          text: "大理古城在唐、宋500多年的历史间是云南的政治、经济、文化的中心，在古城内分布了14处市级以上的重点文物保护单位，承载着大理历史文化、宗教文化、民族文化，是大理旅游核心区，设有大理古城景区，为国家4A级景区。 [3] [40]2019年10月，入选首届“小镇美学榜样”名单。",
        },
        {
          id: 13,
          title: "大理（苍山）",
          imgUrl: require("@/./assets/imgage/IMG_20240317_171230.jpg"),
          text: "苍山，亦称点苍山，在古籍中又有玷苍山、熊苍山、大理山之称，属喜马拉雅造山带南延部分之横断山脉云岭 [4]，位于云南省大理白族自治州中部，洱海之西，东经100°55′00″～100°11′30″，北纬25°34′30″～26°00′00″之间，是大理市与漾濞彝族自治县的分界山岭，山势西北一东南走向，北起花甸坝之西的光蓝坝垭口，南至西洱河，长约48千米，东西宽约18千米。苍山山脉连脊屏列自北而南由19座山峰组成，海拔3074～4122米，最高峰马龙峰海拔高达4122米，与西坡河谷相对高差约2500米，与东坡洱海相对高差约2100米",
        },
        {
          id: 14,
          title: "圆通山动物园",
          imgUrl: require("@/./assets/imgage/ying_hua.jpg"),
          text: "山上建有昆明圆通山动物园，饲养有猴、叶猴、熊猫、犀鸟、狮、象、金钱豹、斑马、云南虎、野牛、野象、孔雀、丹顶鹤、蚧等珍禽异兽500多种，孔雀园格外引入注目。为云南(动物工国)的缩影。还有水族宫，陈列各种鱼类，供人们观赏。园中种植的花木有樱花、海棠花、梅花、茶花、桂花、桃花、杏花、兰花及松、柏、竹等，四时名花相继开放，争奇斗艳。特别是每年阳春三月海棠花盛开之时，繁花似锦，花团锦簇，绚丽多姿，游客如云，赏樱花是昆明人的一大乐趣，“圆通花潮”是昆明胜景之-。",
        },
        {
          id: 15,
          title: "云南艺术剧院（脱口秀）",
          imgUrl: require("@/./assets/imgage/20240409153400.jpg"),
          text: "云南艺术剧院 [1]作为全省唯一的重点剧场从五十年代一直担负着云南省与国外、省内外之间的艺术交流任务。在它的舞台上不断涌现来自世界各地艺术家的精彩表演，雄壮的乐章、翩翩的舞姿在这里展现。同时作为对外交流的窗口，云南艺术剧院已将数十台具有民族特色的歌舞送到东南亚国家、中国香港地区、中国台湾地区、日本等。 [2]云南杨丽萍文化传播股份有限公司旗下的大型原生态歌舞集《云南映象》曾在云南艺术剧院上演，2019年12月云南艺术剧院正式开始自营，面向社会开展租赁、剧目合作等业务。",
        },
        {
          id: 16,
          title: "轿子雪山风景区",
          imgUrl: require("@/./assets/imgage/DJI_20240330_135335_118.jpg"),
          text: "轿子雪山位于禄劝县与东川区交界处，距禄劝县城150余公里，海拔4344.1米，属于季节性雪山，为北半球纬度最低的雪山，因其山型似一乘放置在万山丛中的花轿而得名。当地亦称之老雪山，历史上曾称之为绛云露山、松外龙山、乌龙山、雪山、云弄山，唐德宗兴元元年（784），南诏蒙氏异牟寻封之为东岳。轿子雪山由轿子山、棋王山、东英山、观音山等山峰组成，主峰海拔4223.4米，为滇中第一高峰，是滇中典型的山岳形冰川地貌景观。",
        },
        {
          id: 17,
          title: "翠湖公园",
          imgUrl: require("@/./assets/imgage/IMG_0531.jpg"),
          text: "翠湖公园位于昆明市区的螺峰山下，五华山西麓，云南大学正门对面，原名菜海子。这里最初曾是滇池中的一个湖湾，后来因水位下降而成为一汪清湖。翠湖水光潋滟，绿树成荫，楼现波心，环境优美，是昆明城内的一颗绿宝石。享有城中之玉的美称。元朝以前，滇池水位高，这里还属于城外的小湖湾，多稻田、菜园、莲池，故称【菜海子】。因东北面有九股泉，汇流成池，又名【九龙池】。到民国初年，改辟为园，园内遍植柳树，湖内多种荷花，始有【翠湖】美称。",
        },
        {
          id: 18,
          title: "讲武堂",
          imgUrl: require("@/./assets/imgage/DJI_20240405_153538_819.jpg"),
          text: "19世纪末～20世纪初，清政府编练新军，在全国广设军事学堂。影响较大的有云南陆军讲武堂和北洋陆军讲武堂等。讲武堂的军事课分学科和术科。1906年，直隶总督兼北洋大臣袁世凯在天津韩家墅创立北洋陆军讲武堂，学员定额180名，为现代兵者研究武学之所。后各地督抚经奏准，陆续建立了南洋（设于南京）、江西、云南、东三省、湖南、广东等陆军讲武堂。云南陆军讲武堂是中国近代一所著名军事院校，“黄埔军校的摇篮”，开办于1909年。与创办于1906年的北洋讲武堂（天津）和创办于1908年的东北讲武堂（奉天）并称三大讲武堂。",
        },
      ],
    }
  },
  mounted() {},
  methods: {
    openClick(valueText) {
      this.open = true
      this.dialogTitle = valueText.title
      this.textVlaue = valueText.text
      this.textImg = valueText.imgUrl
    },
  },
}
// import jssheep from "./sheep";

// export default jssheep;
</script>

<style lang="less">
// @import '';
.Photogs {
  .dialogLand {
    .el-dialog {
      height: 70%;
      overflow: hidden;

      .el-dialog__body {
        padding: 10px;
        overflow-y: scroll;
        max-height: 80%;
        margin: 10px;
      }
      .el-dialog__headerbtn {
        top: 2px;
      }
    }
  }
}
</style>
